bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Platform/IBL/Platform/GD32A513/ibl_flash.c
/*!
    \file    ibl_flash.c
    \brief   IBL flash configure for GD32 SDK

    \version 2024-06-30, V1.0.0, demo for GD32
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "Source/IBL_Source/ibl_includes.h"

uint32_t flash_tot_sz;

#if defined(PLATFORM_GD32F5XX) || defined(PLATFORM_GD32H7XX)  || defined(PLATFORM_GD32A513)
static void qspi_flash_gpio_config(void)
{
}

static void qspi_flash_write_enable(void)
{
}

static void qspi_flash_autopolling_ready(void)
{
}

void qspi_flash_config(uint32_t clock_prescaler)
{
}

int32_t qspi_flash_erase_sector(uint32_t address)
{
    return 0;
}

int32_t qspi_flash_erase_chip(void)
{
    return 0;
}

int32_t qspi_flash_read(uint32_t address, void *data, uint32_t size)
{
    return 0;
}

int32_t qspi_flash_program_page(uint32_t address, const uint8_t *data, uint32_t size)
{
    return 0;
}

int is_sip_flash(void)
{
//    return (OBSTAT_NQSPI() == SET);
    return 1;
}

int is_valid_flash_offset(uint32_t offset)
{
    if (offset < flash_total_size()) {
        return 1;
    }
    return 0;
}

int is_valid_flash_addr(uint32_t addr)
{
    int bvalid = 0;
    if (((addr >= FLASH_BASE) && (addr < (FLASH_BASE + flash_total_size())))
        || ((addr >= FLASH_BASE) && (addr < (FLASH_BASE + flash_total_size())))) {
        bvalid = 1;
    }
    return bvalid;
}

uint32_t flash_total_size(void)
{
    if (flash_tot_sz)
        return flash_tot_sz;
    else
       return FLASH_TOTAL_SIZE;
}

uint32_t flash_erase_size(void)
{
    if (is_sip_flash()) {
        return FLASH_SIP_PAGE_SIZE;
    }
    return 0;
}

int flash_init(void)
{
#if defined(GD32F5XX)
    /* need to do nothing */
    return 0;
#else /* GD32F5xx */
    return 0;
#endif
}

void flash_nodec_config(uint32_t nd_idx, uint32_t start_page, uint32_t end_page)
{

}

int flash_read(uint32_t offset, void *data, int len)
{
    uint32_t i;
    uint32_t dst = (uint32_t)data;
    uint32_t left;

    if ((offset & 3) || (dst & 3)) {
        for (i = 0; i < len; i++) {
            ((uint8_t *)data)[i] = *(uint8_t *)(FLASH_BASE + offset + i);
        }
    } else {
        left = (len & 3);
        len -= left;
        for (i = 0; i < len; i += 4) {
            *(uint32_t *)(dst + i) = *(uint32_t *)(FLASH_BASE + offset + i);
        }
        if (left > 0)
            ibl_memcpy((uint8_t *)(dst + len), (uint8_t *)(FLASH_BASE+ offset + len), left);
    }
    return 0;
}

/* consider encrypted image, two flash read api will be needed,
   one is directly read and flash value is decrypted, another is indirect
   read and no decryption is done.
*/
int flash_read_indirect(uint32_t offset, void *data, int len)
{
    uint32_t i;
    uint32_t dst = (uint32_t)data;
    uint32_t left;

    if (!is_valid_flash_offset(offset) || data == NULL
        || len <= 0 || !is_valid_flash_offset(offset + len - 1)) {
        return -1;
    }

    if (is_sip_flash()) {
        if ((offset & 3) || (dst & 3)) {
            for (i = 0; i < len; i++) {
                ((uint8_t *)data)[i] = *(uint8_t *)(FLASH_BASE + offset + i);
            }
        } else {
            left = (len & 3);
            len -= left;
            for (i = 0; i < len; i += 4) {
                *(uint32_t *)(dst + i) = *(uint32_t *)(FLASH_BASE + offset + i);
            }
            if (left > 0)
                ibl_memcpy((uint8_t *)(dst + len), (uint8_t *)(FLASH_BASE + offset + len), left);
        }
    } else {
    }
    return 0;
}

int flash_write_fast(uint32_t offset, const void *data, int len)
{
    int ret = 0;

    return ret;
}

#if defined(PLATFORM_GD32A513)      /* GD32A513 is uint64 write */
int flash_write(uint32_t offset, const void *data, int len)
{
    uint8_t *data_u8 = (uint8_t *)data;
    uint32_t base_addr;
    uint64_t data_temp;

    if (is_sip_flash()) {
        uint32_t offset_align;
        uint64_t val32;
        int vb, act_len, i;
        uint8_t val[8] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

        base_addr = FLASH_BASE;
        /* unlock the flash program erase controller */
        fmc_unlock();
        /* clear pending flags */
#if defined(PLATFORM_GD32A513)
        /* clear pending flags */
        fmc_flag_clear(FMC_BANK0_FLAG_END);
        fmc_flag_clear(FMC_BANK1_FLAG_END);
        fmc_flag_clear(FMC_BANK0_FLAG_PGSERR);
        fmc_flag_clear(FMC_BANK1_FLAG_PGSERR);
        fmc_flag_clear(FMC_BANK0_FLAG_WPERR);
        fmc_flag_clear(FMC_BANK1_FLAG_WPERR);
        fmc_flag_clear(FMC_BANK0_FLAG_PGERR);
        fmc_flag_clear(FMC_BANK1_FLAG_PGERR);
#endif

        offset_align = (offset & ~0x7);

        /* if offset is not 4-byte alignment */
        vb = (offset & 0x7);
        if (vb > 0) {
            act_len = ((8 - vb) > len) ? len : (8 - vb);
            for (i = 0; i < act_len; i++) {
                val[vb + i] = *(data_u8 + i);
            }
#if 0
            if (act_len == 1) {
                    d0 = (~(*data_u8) & 0xFF);
                    val = ~(d0 << (vb * 8));
            } else if (act_len == 2) {
                    d0 = (~(*data_u8) & 0xFF);
                    d1 = (~(*(data_u8 + 1)) & 0xFF);
                    val = ~((d0 << (vb * 8)) | (d1 << ((vb + 1) * 8)));
            } else if (act_len == 3) {
                    d0 = (~(*data_u8) & 0xFF);
                    d1 = (~(*(data_u8 + 1)) & 0xFF);
                    d2 = (~(*(data_u8 + 2)) & 0xFF);
                    val = ~((d0 << 8) | (d1 << 16) | (d2 << 24));
            }
#endif
            fmc_doubleword_program((base_addr + offset_align), *(uint64_t *)val);
            offset_align += 8;
            data_u8 += act_len;
            len -= act_len;
        }

        /* word program */
        while (len >= 8) {
            /* at optimization level O1, casting an odd address to uint64_t * may cause unaligned access faults. */
            ibl_memcpy((uint8_t *)(&data_temp), data_u8, sizeof(uint64_t));
            fmc_doubleword_program((base_addr + offset_align), data_temp);
            offset_align += 8;
            data_u8 += 8;
            len -= 8;
        }

        /* if len is not 4-byte alignment */
        val32 = 0xFFFFFFFFFFFFFFFF;
        if (len > 0) {
            while (len-- > 0) {
                val32 = (val32 << 8);
                val32 |= *(data_u8 + len);
            }
            fmc_doubleword_program((base_addr + offset_align), val32);
        }

        /* lock the flash program erase controller */
        fmc_lock();
    } else {
#if defined(PLATFORM_GDM32)
        uint32_t page_offset;
        uint32_t size_to_program;

        base_addr = FLASH_START_QSPI;
        page_offset = (offset & (FLASH_QSPI_PAGE_SIZE - 1));
        if (page_offset != 0) {
            size_to_program = (len > FLASH_QSPI_PAGE_SIZE - page_offset) ? (FLASH_QSPI_PAGE_SIZE - page_offset) : len;
            qspi_flash_program_page((base_addr + offset), data_u8, size_to_program);
            offset += size_to_program;
            data_u8 += size_to_program;
            len -= size_to_program;
        }

        while (len > 0) {
            size_to_program = (len > FLASH_QSPI_PAGE_SIZE) ? FLASH_QSPI_PAGE_SIZE : len;
            qspi_flash_program_page((base_addr + offset), data_u8, size_to_program);
            offset += size_to_program;
            data_u8 += size_to_program;
            len -= size_to_program;
        }
#endif /* PLATFORM_GDM32 */
    }
    return 0;
}
#else
int flash_write(uint32_t offset, const void *data, int len)
{
    uint8_t *data_u8 = (uint8_t *)data;
    uint32_t base_addr;

