bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Platform/IBL/Platform/GD32A513/ibl_flash.c
    if (is_sip_flash()) {
        uint32_t offset_align, val32;
        int vb, act_len, i;
        uint8_t val[4] = {0xFF, 0xFF, 0xFF, 0xFF};

        base_addr = FLASH_BASE;
        /* unlock the flash program erase controller */
        fmc_unlock();
        /* clear pending flags */
#if defined(PLATFORM_GD32F5XX)
        /* clear pending flags */
        fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_PGAERR | FMC_FLAG_WPERR);
#elif defined(PLATFORM_GD32H7XX)
        /* clear pending flags */
        fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_PGSERR | FMC_FLAG_WPERR);
#endif

        offset_align = (offset & ~0x3);

        /* if offset is not 4-byte alignment */
        vb = (offset & 0x3);
        if (vb > 0) {
            act_len = ((4 - vb) > len) ? len : (4 - vb);
            for (i = 0; i < act_len; i++) {
                val[vb + i] = *(data_u8 + i);
            }
#if 0
            if (act_len == 1) {
                    d0 = (~(*data_u8) & 0xFF);
                    val = ~(d0 << (vb * 8));
            } else if (act_len == 2) {
                    d0 = (~(*data_u8) & 0xFF);
                    d1 = (~(*(data_u8 + 1)) & 0xFF);
                    val = ~((d0 << (vb * 8)) | (d1 << ((vb + 1) * 8)));
            } else if (act_len == 3) {
                    d0 = (~(*data_u8) & 0xFF);
                    d1 = (~(*(data_u8 + 1)) & 0xFF);
                    d2 = (~(*(data_u8 + 2)) & 0xFF);
                    val = ~((d0 << 8) | (d1 << 16) | (d2 << 24));
            }
#endif
            fmc_word_program((base_addr + offset_align), *(uint32_t *)val);
            offset_align += 4;
            data_u8 += act_len;
            len -= act_len;
        }

        /* word program */
        while (len >= 4) {
            fmc_word_program((base_addr + offset_align), *(uint32_t *)data_u8);
            offset_align += 4;
            data_u8 += 4;
            len -= 4;
        }

        /* if len is not 4-byte alignment */
        val32 = 0xFFFFFFFF;
        if (len > 0) {
            while (len-- > 0) {
                val32 = (val32 << 8);
                val32 |= *(data_u8 + len);
            }
            fmc_word_program((base_addr + offset_align), val32);
        }

        /* lock the flash program erase controller */
        fmc_lock();
    } else {
#if defined(PLATFORM_GDM32)
        uint32_t page_offset;
        uint32_t size_to_program;

        base_addr = FLASH_START_QSPI;
        page_offset = (offset & (FLASH_QSPI_PAGE_SIZE - 1));
        if (page_offset != 0) {
            size_to_program = (len > FLASH_QSPI_PAGE_SIZE - page_offset) ? (FLASH_QSPI_PAGE_SIZE - page_offset) : len;
            qspi_flash_program_page((base_addr + offset), data_u8, size_to_program);
            offset += size_to_program;
            data_u8 += size_to_program;
            len -= size_to_program;
        }

        while (len > 0) {
            size_to_program = (len > FLASH_QSPI_PAGE_SIZE) ? FLASH_QSPI_PAGE_SIZE : len;
            qspi_flash_program_page((base_addr + offset), data_u8, size_to_program);
            offset += size_to_program;
            data_u8 += size_to_program;
            len -= size_to_program;
        }
#endif /* PLATFORM_GDM32 */
    }
    return 0;
}
#endif

int flash_erase(uint32_t offset, int len)
{
    int ret;
    uint32_t erase_sz = flash_erase_size();
    uint32_t page_start, sector_start;

//    if (!is_valid_flash_offset(offset)
//        || len <= 0 || !is_valid_flash_offset(offset + len - 1)) {
//        return -1;
//    }
#if defined GD32F5XX_BANKS_SWP_USED
    uint8_t run_img;
    /* bank switch set */
    sys_status_get(SYS_RUNNING_IMG, LEN_SYS_RUNNING_IMG, &run_img);
    rcu_periph_clock_enable(RCU_SYSCFG);
    if (1 == run_img && ((SYSCFG_CFG0&SYSCFG_CFG0_FMC_SWP)!=0)) {
        if(offset<0x200000) {
            /* bank swap not effect when erase */
            offset = offset + 0x200000;
        } else if(offset<0x400000) {
            /* bank swap not effect when erase */
            offset = offset - 0x200000;
        } else {
        }
    }
#endif /* GD32F5XX_BANKS_SWP_USED */

    if (is_sip_flash()) {
        /* Get page start */
        page_start = FLASH_BASE + (offset & (~(erase_sz - 1)));

        /* unlock the flash program erase controller */
        fmc_unlock();
#if defined(PLATFORM_GD32F5XX)
        /* clear pending flags */
        fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_PGAERR | FMC_FLAG_WPERR);
#elif defined(PLATFORM_GD32H7XX)
        /* clear pending flags */
        fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_PGSERR | FMC_FLAG_WPERR);
#elif defined(PLATFORM_GD32A513)
        /* clear pending flags */
        fmc_flag_clear(FMC_BANK0_FLAG_END);
        fmc_flag_clear(FMC_BANK1_FLAG_END);
        fmc_flag_clear(FMC_BANK0_FLAG_PGSERR);
        fmc_flag_clear(FMC_BANK1_FLAG_PGSERR);
        fmc_flag_clear(FMC_BANK0_FLAG_WPERR);
        fmc_flag_clear(FMC_BANK1_FLAG_WPERR);
        fmc_flag_clear(FMC_BANK0_FLAG_PGERR);
        fmc_flag_clear(FMC_BANK1_FLAG_PGERR);
#endif

        while (len > 0) {
            /* erase page */
#if defined(PLATFORM_GD32F5XX) || defined(PLATFORM_GD32A513)
            ret = fmc_page_erase(page_start);
#if defined(PLATFORM_GD32A513)
        /* clear pending flags */
        fmc_flag_clear(FMC_BANK0_FLAG_END);
        fmc_flag_clear(FMC_BANK1_FLAG_END);
        fmc_flag_clear(FMC_BANK0_FLAG_PGSERR);
        fmc_flag_clear(FMC_BANK1_FLAG_PGSERR);
        fmc_flag_clear(FMC_BANK0_FLAG_WPERR);
        fmc_flag_clear(FMC_BANK1_FLAG_WPERR);
        fmc_flag_clear(FMC_BANK0_FLAG_PGERR);
        fmc_flag_clear(FMC_BANK1_FLAG_PGERR);
#endif
#elif defined(PLATFORM_GD32H7XX)
            ret = fmc_sector_erase(page_start);
#endif
            if (ret != FMC_READY)
                return -2;
            page_start += erase_sz;
            len -= erase_sz;
        }
        /* lock the flash program erase controller */
        fmc_lock();
    }
    return 0;
}

int flash_erase_chip(void)
{
    int ret;

    return ret;
}

int flash_get_obstat(void *stat)
{
    return 0;
}

void flash_set_ob(uint32_t ob)
{
}

