bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Platform/IBL/Platform/GD32A513/ibl_flash.c
uint32_t flash_get_ob(void)
{
    return 0;
}

#if (IBL_VERSION >= V_1_1)
void flash_set_obusr(uint32_t obusr)
{
}

uint32_t flash_get_obusr(void)
{
//    return fmc_get_obusr();
    return 0;
}
#endif
void flash_set_secwm(uint32_t wmidx, uint32_t start_page, uint32_t end_page)
{
}

uint32_t flash_get_secwm(uint32_t wmidx)
{
    return 0;
}
#if (IBL_VERSION >= V_1_1)
void flash_set_hdpwm(uint32_t idx, uint32_t enable, uint32_t end_page)
{
}

uint32_t flash_get_hdpwm(uint32_t idx)
{
    return 0;
}

void flash_set_wrp(uint32_t idx, uint32_t start_page, uint32_t end_page)
{
}

uint32_t flash_get_wrp(uint32_t idx)
{
    return 0;
}
#endif
#endif

#ifdef ROM_SELF_TEST
void flash_self_test(void)
{
    uint32_t offset, offset_orig = 0x100000;
    uint8_t val_in[16], val_out[16];
    int i, ret, sum;

    /* erase page or sector */
    offset = offset_orig;
    ibl_printf("========== Erase 1st page at 0x%08x ===========\r\n", offset);
    ret = flash_erase(offset, flash_erase_size());
    if (ret != 0) {
        ibl_printf("Flash erase failed (%d)\r\n", ret);
        return;
    } else {
        ibl_printf("Flash erase OK\r\n");
    }

    /* write 1,2,4,15 bytes with aligned address */
    /* read 1,2,4,15 bytes with aligned address */
    ibl_printf("========== Write 1 byte (aligned addr) ===========\r\n");
    val_in[0] = 0x5A;
    ret = flash_write(offset, val_in, 1);
    if (ret != 0) {
        ibl_printf("Flash write 1 byte failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 1);
    if (ret != 0) {
        ibl_printf("Flash read 1 byte failed (%d)\r\n", ret);
        return;
    }
    if (val_in[0] != val_out[0]) {
        ibl_printf("Flash write 1 byte failed (0x%x vs 0x%x)\r\n", val_in[0], val_out[0]);
        return;
    } else {
        ibl_printf("Flash write 1 byte OK\r\n");
    }

    ibl_printf("========== Write 2 bytes (aligned addr) ===========\r\n");
    offset = offset_orig + 4;
    *(uint16_t*)val_in = 0x962d;
    ret = flash_write(offset, val_in, 2);
    if (ret != 0) {
        ibl_printf("Flash write 2 bytes failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 2);
    if (ret != 0) {
        ibl_printf("Flash read 2  bytes failed (%d)\r\n", ret);
        return;
    }
    if (*(uint16_t*)val_in != *(uint16_t*)val_out) {
        ibl_printf("Flash write 2 bytes failed (0x%x vs 0x%x)\r\n", *(uint16_t*)val_in, *(uint16_t*)val_out);
        return;
    } else {
        ibl_printf("Flash write 2 bytes OK\r\n");
    }

    ibl_printf("========== Write 4 bytes (aligned addr) ===========\r\n");
    offset = offset_orig + 8;
    *(uint32_t*)val_in = 0x3cb41e87;
    ret = flash_write(offset, val_in, 4);
    if (ret != 0) {
        ibl_printf("Flash write 4 bytes failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 4);
    if (ret != 0) {
        ibl_printf("Flash read 4 bytes failed (%d)\r\n", ret);
        return;
    }
    if (*(uint32_t*)val_in != *(uint32_t*)val_out) {
        ibl_printf("Flash write 4 bytes failed (0x%x vs 0x%x)\r\n", *(uint32_t*)val_in, *(uint32_t*)val_out);
        return;
    } else {
        ibl_printf("Flash write 4 bytes OK\r\n");
    }

    ibl_printf("========== Write 15 bytes (aligned addr) ===========\r\n");
    offset = offset_orig + 0x10;
    for (i = 0; i < 15; i++) {
        val_in[i] = i;
    }
    ret = flash_write(offset, val_in, 15);
    if (ret != 0) {
        ibl_printf("Flash write 15 bytes failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 15);
    if (ret != 0) {
        ibl_printf("Flash read 15  bytes failed (%d)\r\n", ret);
        return;
    }
    if (memcmp(val_in, val_out, 15)) {
        ibl_printf("Flash write 15  bytes failed\r\n");
        ibl_print_data(IBL_ALWAYS, "Value in:", val_in, 15);
        ibl_print_data(IBL_ALWAYS, "Value out:", val_out, 15);
        return;
    } else {
        ibl_printf("Flash write 15 bytes OK\r\n");
    }

    /* write 1,2,4,15 bytes with unaligned address */
    /* read 1,2,4,15 bytes with unaligned address */
    ibl_printf("========== Write 1 byte (unaligned addr) ===========\r\n");
    offset = offset_orig + 0x22;
    val_in[0] = 0x5A;
    ret = flash_write(offset, val_in, 1);
    if (ret != 0) {
        ibl_printf("Flash write 1 byte failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 1);
    if (ret != 0) {
        ibl_printf("Flash read 1 byte failed (%d)\r\n", ret);
        return;
    }
    if (val_in[0] != val_out[0]) {
        ibl_printf("Flash write 1 byte failed (0x%x vs 0x%x)\r\n", val_in[0], val_out[0]);
        return;
    } else {
        ibl_printf("Flash write 1 byte OK\r\n");
    }

    ibl_printf("========== Write 2 bytes (unaligned addr) ===========\r\n");
    offset = offset_orig + 0x23;
    *(uint16_t*)val_in = 0x962d;
    ret = flash_write(offset, val_in, 2);
    if (ret != 0) {
        ibl_printf("Flash write 2 bytes failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 2);
    if (ret != 0) {
        ibl_printf("Flash read 2 bytes failed (%d)\r\n", ret);
        return;
    }
    if (*(uint16_t*)val_in != *(uint16_t*)val_out) {
        ibl_printf("Flash write 2 bytes failed (0x%x vs 0x%x)\r\n", *(uint16_t*)val_in, *(uint16_t*)val_out);
        return;
    } else {
        ibl_printf("Flash write 2 bytes OK\r\n");
    }

    ibl_printf("========== Write 4 bytes (unaligned addr) ===========\r\n");
    offset = offset_orig + 0x25;
    *(uint32_t*)val_in = 0x3cb41e87;
    ret = flash_write(offset, val_in, 4);
    if (ret != 0) {
        ibl_printf("Flash write 4 bytes failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 4);
    if (ret != 0) {
        ibl_printf("Flash read 4 bytes failed (%d)\r\n", ret);
        return;
    }
    if (*(uint32_t*)val_in != *(uint32_t*)val_out) {
        ibl_printf("Flash write 4 bytes failed (0x%x vs 0x%x)\r\n", *(uint32_t*)val_in, *(uint32_t*)val_out);
        return;
    } else {
        ibl_printf("Flash write 4 bytes OK\r\n");
    }

    ibl_printf("========== Write 15 bytes (unaligned addr) ===========\r\n");
    offset = offset_orig + 0x29;
    for (i = 0; i < 15; i++) {
        val_in[i] = i;
    }
    ret = flash_write(offset, val_in, 15);
    if (ret != 0) {
        ibl_printf("Flash write 15 bytes failed (%d)\r\n", ret);
        return;
    }
    ret = flash_read(offset, val_out, 15);
    if (ret != 0) {
        ibl_printf("Flash read 15 bytes failed (%d)\r\n", ret);
        return;
    }
    if (memcmp(val_in, val_out, 15)) {
        ibl_printf("Flash write 15 bytes failed\r\n");
        ibl_print_data(IBL_ALWAYS, "Value in:", val_in, 15);
        ibl_print_data(IBL_ALWAYS, "Value out:", val_out, 15);
        return;
    } else {
        ibl_printf("Flash write 15 bytes OK\r\n");
    }

    ret = flash_erase(offset_orig, flash_erase_size());
    if (ret != 0) {
        ibl_printf("Flash erase failed (%d)\r\n", ret);
        return;
    } else {
        ibl_printf("Flash erase OK\r\n");
    }

    ibl_printf("========== Program non-secure page use SECCTL ===========\r\n");
    offset = offset_orig;
    *(uint32_t*)val_in = 0x3cb41e87;
    ret = flash_write(offset, val_in, 4);
    if (ret != 0) {
        ibl_printf("Program failed (%d)\r\n", ret);
        return;
    } else {
        ibl_printf("Program OK.\r\n");
    }
    ibl_printf("========== Erase non-secure page use SECCTL ===========\r\n");
    ret = flash_erase(offset, flash_erase_size());
    if (ret != 0) {
        ibl_printf("Erase failed (%d)\r\n", ret);
        return;
    } else {
        ibl_printf("Erase OK\r\n");
    }

