bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Platform/IBL/Platform/GD32A513/ibl_flash.c
}

void flash_speed_test(void)
{
    const uint32_t offset = 0x100000;
    const uint32_t erase_size = 0x100000;
    int i, ret;
    uint8_t data[512];

    /* erase page or sector */
    ibl_printf("Erase\r\n");
    ret = flash_erase(offset, erase_size);
    if (ret != 0) {
        ibl_printf("Flash erase failed (%d)\r\n", ret);
        return;
    } else {
        ibl_printf("OK\r\n");
    }
    /* write with aligned address */
    ibl_printf("Write aligned\r\n");
    for (i = offset; i < offset + erase_size; i += sizeof(data)) {
        ret = flash_write_fast(i, data, sizeof(data));
        if (ret != 0) {
            ibl_printf("Flash write failed (%d)\r\n", ret);
            return;
        }
    }
    ibl_printf("OK\r\n");

    /* read with aligned address */
    ibl_printf("Read aligned\r\n");
    for (i = offset; i < offset + erase_size; i += sizeof(data)) {
        ret = flash_read(i, data, sizeof(data));
        if (ret != 0) {
            ibl_printf("Flash read failed (%d)\r\n", ret);
            return;
        }
    }
    ibl_printf("OK\r\n");

    /* read indirect with aligned address */
    ibl_printf("Read indirect aligned\r\n");
    for (i = offset; i < offset + erase_size; i += sizeof(data)) {
        ret = flash_read_indirect(i, data, sizeof(data));
        if (ret != 0) {
            ibl_printf("Flash read indirect failed (%d)\r\n", ret);
            return;
        }
    }
    ibl_printf("OK\r\n");

    /* erase page or sector */
    ibl_printf("Erase\r\n");
    ret = flash_erase(offset, erase_size);
    if (ret != 0) {
        ibl_printf("Flash erase failed (%d)\r\n", ret);
        return;
    } else {
        ibl_printf("OK\r\n");
    }

    /* write with unaligned address */
    ibl_printf("Write unaligned\r\n");
    for (i = offset; i < offset + erase_size; i += sizeof(data)) {
        ret = flash_write_fast(i - 1, data, sizeof(data));
        if (ret != 0) {
            ibl_printf("Flash write failed (%d)\r\n", ret);
            return;
        }
    }
    ibl_printf("OK\r\n");

    /* read with unaligned address */
    ibl_printf("Read unaligned\r\n");
    for (i = offset; i < offset + erase_size; i += sizeof(data)) {
        ret = flash_read(i - 1, data, sizeof(data));
        if (ret != 0) {
            ibl_printf("Flash read failed (%d)\r\n", ret);
            return;
        }
    }
    ibl_printf("OK\r\n");

    /* read indirect with unaligned address */
    ibl_printf("Read indirect unaligned\r\n");
    for (i = offset; i < offset + erase_size; i += sizeof(data)) {
        ret = flash_read_indirect(i - 1, data, sizeof(data));
        if (ret != 0) {
            ibl_printf("Flash read indirect failed (%d)\r\n", ret);
            return;
        }
    }
    ibl_printf("OK\r\n");
}
#endif

